In [9]:
import pandas as pd
google=pd.read_csv("dataframe_example.csv")
google

      Name   Subject  credits  Marks
0    rajat      math       12     78
1     ajay   science       10     93
2   mukesh      math        8     54
3    rahul   science        9     89
4   shobna  computer       13     76
5     aman  computer        5     54
6      raj   economy        6     32
7   rajesh   economy       15     12
8  shubham       bio        2      9
9    pyush      math        7     92

In [10]:
google.dtypes

Name       object
Subject    object
credits     int64
Marks       int64
dtype: object

In [11]:
google.columns

Index(['Name', 'Subject', 'credits', 'Marks'], dtype='object')

In [12]:
google.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
Name       10 non-null object
Subject    10 non-null object
credits    10 non-null int64
Marks      10 non-null int64
dtypes: int64(2), object(2)
memory usage: 280.0+ bytes

In [13]:
google.get_dtype_counts()

int64     2
object    2
dtype: int64

In [14]:
google.sum()#it provides sum in column wise.

Name       rajatajaymukeshrahulshobnaamanrajrajeshshubham...
Subject    mathsciencemathsciencecomputercomputereconomye...
credits                                                   87
Marks                                                    589
dtype: object

In [15]:
google.sum(axis=1)#it provides sum in row wise.

0     90
1    103
2     62
3     98
4     89
5     59
6     38
7     27
8     11
9     99
dtype: int64

In [16]:
google[["Name"]]

      Name
0    rajat
1     ajay
2   mukesh
3    rahul
4   shobna
5     aman
6      raj
7   rajesh
8  shubham
9    pyush

In [19]:
google[["Name","Subject"]]

      Name   Subject
0    rajat      math
1     ajay   science
2   mukesh      math
3    rahul   science
4   shobna  computer
5     aman  computer
6      raj   economy
7   rajesh   economy
8  shubham       bio
9    pyush      math